# Вторая задача:
# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков

dict_all = {1 : 'AEIOULNSTRАВЕИНОРСТ', 2 : 'DGДКЛМПУ', 3 : 'BCMPБГЁЬЯ', 4 : 'FHVWYЙЫ', 5 : 'KЖЗХЦЧ', 8 : 'JXШЭЮ', 10 : 'QZФЩЪ'}

word = (input('Введите слово: ')).upper()

price = 0
for key in dict_all:
    for i in word:
        if i in dict_all[key]:
            price = price+key
print(f'Ценность слова {word} равна {price}')
